#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=81776136-87a7-49cc-8414-b47235b1ff03]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4ec7c321-b3c7-484d-b25d-b1b5f0b87da5]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=156bc55b-210e-4f01-a713-0e6c11cf0361]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=38014355-1b16-496d-ad27-43eb8516db81]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1a5a45fe-e20c-4a4e-b7df-e27df4edbb0a]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e10a6e98-1292-4605-9c6b-ccf3838d712b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6677d385-777e-4c8d-a5ee-594194b6d3de]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=77e7e184-f43b-4b75-9a53-07b51f233d13]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=99ffa2ac-d2f0-4891-a4cb-e5995275f66a]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9bbbb147-8a84-49b3-a0bf-3ef8da612f54]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8a1c0c79-82b1-4433-aec2-04139bd9e83c]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=05224e67-b8fa-443b-871f-acb3040e8bbb]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8922455-5068-4300-add2-dc1604ebf9ee]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0f6f8dd9-b6af-48e0-8662-7a4de1b675c4]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4b46641d-88f3-45b9-8470-fe9c5a09d2fa]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7888c0f9-7cfc-4017-9248-cee1c419c7a7]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9840615d-67c9-4e53-8d2b-59e5c684075c]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=81ae7720-b6b4-4b44-9a91-1467bc214c5b]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=895aee78-2a68-44ec-85c3-b05bda2df617]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=90968149-1285-4050-959a-c52f6f9d014d]
module.keycloak_dev.module.onestopauth.module.client_jon-email-test-597.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=07b95208-e650-4cb4-920c-a82573040bf9]
module.keycloak_dev.module.onestopauth.module.client_jon-email-test-597.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1d8ef3b7-507b-455b-9913-8bba37d80b65]
module.keycloak_dev.module.onestopauth.module.client_jon-email-test-597.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9f1c1b69-1fea-4dc3-af60-e05fb3a2700c]
module.keycloak_dev.module.onestopauth.module.client_jon-email-test-597.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e7593928-bd9d-4c46-9946-52f7462f4ac8]
module.keycloak_dev.module.onestopauth.module.client_jon-email-test-597.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=08b8158e-d726-4f55-8bee-aa61862330f8]
module.keycloak_dev.module.onestopauth.module.client_jon-email-test-597.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=563182e1-b7e5-4de3-9274-f3dc42928f4e]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d8dc6a5d-5371-49e4-b9ea-3084c92be48b]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7cfea54e-16cd-49ed-9b46-89c63915d19a]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1a060418-f9b1-4147-8cf9-b61026f5a7cd]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2da877d4-52d6-4030-a575-825bfc356689]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e03d33e2-d02a-43eb-b8af-3b39322b8f1b]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=21bc362c-9a0a-4b70-8407-e2ff51ea58b7]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6a455955-558a-4a9b-b4f9-244792055a25]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c31fd301-394d-4828-bd45-ec0751004103]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1445a013-c23c-467f-8264-28a36387e9c6]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=57933b07-9c45-4129-b9f0-46f1d910e1c8]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=306160cd-a478-4c56-b164-e4c00fd957f3]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d463262b-4b9a-4aa2-bace-6b58abea7093]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=74c7c7f9-e7af-41e3-8186-b3d5e5e80639]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bd2afc16-a3a5-474a-8b47-2b30fbd6676f]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=889affb6-1e3a-4390-ba71-b0e0846dae0d]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c912cdfa-fc24-440e-ae83-f9d26f34277b]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3fb093c0-f7d1-4ba1-987e-363814f65908]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ddf77f5a-8101-4fca-aa54-6390449a7f03]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-331.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5a22de4a-429b-4aa6-8e9a-c1c7318236a5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-331.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=303a8e91-68b2-42e4-9f80-cffa21d640af]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-331.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=acbde015-cc99-4b82-aa2c-8311b0b411bf]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-331.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b708126b-a39c-4fd6-aeec-ea801231fc58]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-331.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=53b690fd-b9c2-476e-ab34-0ff8e92e2f42]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-331.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6ce041de-01a3-4ce1-b434-821894b9be12]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "testemailss-1421"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testemailss-1421.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "testemailss-1421"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "testemailss-1421"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:1000",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "testemailss-1421"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_testemailss-1421.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "testemailss-1421"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "testemailss-1421"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:1000",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "testemailss-1421"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_testemailss-1421.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_testemailss-1421.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "testemailss-1421"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "testemailss-1421"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:1000",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1946 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*